app/Controllers/CategoryController.php

    public function delete($id)
    {
        $model = model(CategoryModel::class);
        $model->where('id', $id)->delete();
---
DELETE FROM `category`
WHERE `id` = '39'