app/Controllers/ClientController.php

    public function add_to_cart()
    {

        // $post = $this->request->getPost();
        // $modelCart = model(CartModel::class);

        // $modelCart->save([
        //     'id_product' => isset($post['id_product']) ? $post['id_product'] : '',
        //     'quantity' => isset($post['quantity']) ? $post['quantity'] : '',
        // ]);

        // return redirect()->to(base_url() . 'product_c');

        $session = session();

        $post = $this->request->getPost();

        // Update the record with the provided data.
        $modelProduct = model(ProductModel::class);
        // Get the existing data from the database.
        $existingProduct = $modelProduct->find(isset($post['id_product']) ? $post['id_product'] : '');
---
SELECT *
FROM `product`
WHERE `product`.`id` = '13'