app/Controllers/OrderController.php

    public function handle_status($id)
    {
        $model = model(OrderModel::class);
        $data = [
            'status' => true,
        ];
        $model->update($id, $data);
---
UPDATE `order` SET `status` = 1
WHERE `order`.`id` IN ('8')