app/Controllers/ProductController.php

    public function update($id)
    {
        // Get the validated data.
        $post = $this->request->getPost();

        // Update the record with the provided data.
        $modelProduct = model(ProductModel::class);

        // Get the existing data from the database.
        $existingData = $modelProduct->find($id);

        // Merge the existing data with the new data.
        $data = array_merge($existingData, $post);

        // Handle image upload.
        $uploadedImg = $this->request->getFile('img');
        if ($uploadedImg && $uploadedImg->isValid() && !$uploadedImg->hasMoved()) {
            $newPath = './uploads/products/';
            $newFileName = $uploadedImg->getRandomName();
            $uploadedImg->move($newPath, $newFileName);

            // Update the 'img' field with the new file name.
            $data['img'] = $newFileName;
        }

        // Perform the update.
        $modelProduct->update($id, $data);
---
UPDATE `product` SET `name_product` = 'test', `price` = '222', `quantity` = '222', `detail` = '222', `category_id` = '24'
WHERE `product`.`id` IN ('11')