app/Models/AboutModel.php

SELECT *
FROM `about`
---
    public function getAbout()
    {
        return $this->findAll();

SELECT COUNT(*) AS `numrows` FROM `about`
---
    public function countAbout()
    {
        return $this->countAll();