app/Models/BlogModel.php

    public function getBlog()
    {
        return $this->findAll();
---
SELECT *
FROM `blog`

    public function countBlog()
    {
        return $this->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `blog`