app/Models/CartModel.php

SELECT *
FROM `cart`
---
    public function getCart()
    {
        return $this->findAll();