app/Models/CategoryModel.php

SELECT *
FROM `category`
---
    public function getCategory()
    {
        return $this->findAll();