app/Models/CommentModel.php

SELECT *
FROM `comment`
---
    public function getComment()
    {
        return $this->findAll();