app/Models/ContactModel.php

SELECT *
FROM `contact`
---
    public function getContact()
    {
        return $this->findAll();

SELECT COUNT(*) AS `numrows` FROM `contact`
---
    public function countContact()
    {
        return $this->countAll();

SELECT COUNT(*) AS `numrows`
FROM `contact`
WHERE `status` = 0
---
    public function countContactWithStatus0()
    {
        return $this->where('status', 0)->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `contact`
WHERE `status` = 1
---
    public function countContactWithStatus1()
    {
        return $this->where('status', 1)->countAllResults();