app/Models/OrderModel.php

SELECT *
FROM `order`
---
    public function getOrder()
    {
        return $this->findAll();

SELECT COUNT(*) AS `numrows` FROM `order`
---
    public function countOrder()
    {
        return $this->countAll();

SELECT COUNT(*) AS `numrows`
FROM `order`
WHERE `status` = 0
---
     public function countOrderWithStatus0()
     {
         return $this->where('status', 0)->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `order`
WHERE `status` = 1
---
     public function countOrderWithStatus1()
     {
         return $this->where('status', 1)->countAllResults();