app/Models/OrderDetailModel.php

SELECT *
FROM `order_detail`
---
    public function getOrderDetail()
    {
        return $this->findAll();