app/Models/ProductModel.php

    public function getProduct()
    {
        return $this->findAll();
---
SELECT *
FROM `product`