app/Models/UserModel.php

    public function checkUser($user_name, $user_password)
    {
        $user = $this->where(['user_name' => $user_name])->first();
---
SELECT *
FROM `users`
WHERE `user_name` = 'demo4'
 LIMIT 1

    public function getUserByUsername($username)
    {
        return $this->where('id', 2)->first();
---
SELECT *
FROM `users`
WHERE `id` = '2'
 LIMIT 1