app/Models/UserModel.php

SELECT *
FROM `users`
---
    public function getUser()
    {
        return $this->findAll();